; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation4 - direction
	Star9 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Star8 - direction
	GroundStation6 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star12)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 Star8)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star8)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Star12 thermograph1)
	(have_image Star13 thermograph1)
	(have_image Planet14 spectrograph0)
	(have_image Planet15 spectrograph0)
	(have_image Star16 thermograph1)
))

)

; plan
1. (turn_to satellite0 star5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star5)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet15 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet15)
   goals met: 0 of 7
5. (take_image satellite0 planet15 instrument0 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 1 of 7
6. (turn_to satellite0 planet14 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet14)
   goals met: 1 of 7
7. (take_image satellite0 planet14 instrument0 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 2 of 7
8. (turn_to satellite0 planet11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet11)
   goals met: 2 of 7
9. (take_image satellite0 planet11 instrument0 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 3 of 7
10. (turn_to satellite0 phenomenon10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 7
11. (take_image satellite0 phenomenon10 instrument0 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 4 of 7
12. (turn_to satellite0 star12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star12)
   goals met: 4 of 7
13. (take_image satellite0 star12 instrument0 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 5 of 7
14. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 5 of 7
15. (take_image satellite0 star13 instrument0 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 6 of 7
16. (turn_to satellite0 star16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star16)
   goals met: 6 of 7
17. (take_image satellite0 star16 instrument0 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 7 of 7
